AleMuzzi/SmartSprinkler/firmware/src/esp32/main.cpp
//
// Created by Alessandro Muzzi on 23/03/25.
//

#include <WiFi.h>
#include <utils/string.h>
#include <utils/time.h>

#include <U8g2lib.h>

#include "model/command.h"
#include "model/status.h"
#include "model/route.h"
#include "sensors/actuator.h"

#include "camera.h"
#include "sensors/temp_humidity_sensor.h"
#include "services/CommandManager.h"
#include "utils/hashtable_ext.h"

#include <ESP32Servo.h>
#include <HardwareSerial.h>
#include <Preferences.h>
#include <esp_task_wdt.h>

#include "esp32/event_log.h"
#include "esp32/event_publisher.h"
#include "esp32/log.h"

#if __has_include("server_config.h")
#include "server_config.h"
#endif
#ifndef SMARTSPRINKLER_SERVER_URL
#define SMARTSPRINKLER_SERVER_URL ""
#endif

#if __has_include("fw_version.h")
#include "fw_version.h"
#endif
#ifndef FW_VERSION
#define FW_VERSION "0.0.0"
#endif

#define PIN_PUMP_RELAY 12
#define PIN_ROTARY_SERVO 13

#define SERVO_MIN_US 500
#define SERVO_MAX_US 2500
#define SERVOFreq 50

#define ROTARY_DELTA_DEG 19.0f
#define ROTARY_START_DEG  5.0f
#define ROTARY_POSITION_COUNT 10

#define FLOW_RATE_ML_PER_MIN 1380

#define NANO_RX_PIN 14
#define NANO_TX_PIN 15
#define SOIL_DRY_ADC 1000

#if __has_include("wifi_secrets.h")
#include "wifi_secrets.h"
#endif

#ifndef WIFI_SSID_LOCAL
#define WIFI_SSID_LOCAL ""
#endif
#ifndef WIFI_PASSWORD_LOCAL
#define WIFI_PASSWORD_LOCAL ""
#endif

constexpr char hostname[16] = "smart_sprinkler";

Preferences prefs;
String wifi_ssid;
String wifi_password;

const IPAddress local_IP(192, 168, 1, 10);
const IPAddress gateway(192, 168, 1, 1);
const IPAddress subnet(255, 255, 255, 0);

String WiFiAddr = "";

unsigned long previousMillis = 0;
constexpr long interval = 2000;

float air_temperature = -1;
float air_humidity = -1;
float soil_moisture;

CommandManager command_manager;
Hashtable<String, Route> routes;

const Actuator water_pump(PIN_PUMP_RELAY);
Servo rotary_servo;

Target::Value active_target = Target::NAGA_MORICH;
int rotary_current_position = 0;
bool rotary_calibrated = false;

int soil_moisture_raw[4] = {0, 0, 0, 0};
bool nano_connected = false;

HardwareSerial NanoSerial(2);

bool water_low_alert = false;
int blocked_amount_ml = 0;

bool dispensing_specific = false;
int dispensing_target_ml = 0;
unsigned long dispensing_start_ms = 0;
bool pump_start_pending = false;
unsigned long pump_start_planned_ms = 0;

bool calibration_in_progress = false;
int calibration_step = 0;
bool calibration_all_success = true;
unsigned long calibration_moved_at_ms = 0;

EventLog event_log;
EventPublisher event_publisher(&event_log);

// Edge detection for sensor-derived alerts.
bool prev_water_low_alert = false;
bool prev_sensor_reading_valid = true;
uint32_t last_sensor_warn_ms = 0;
uint32_t last_nano_data_ms = 0;
bool nano_lost_logged = false;

void log_event(const char* category, const char* level, const char* event, const char* message) {
    event_log.append(category, level, event, message);
    Serial.printf("[%s] %s\n", event, message);
}

void log_event_details(const char* category, const char* level, const char* event,
                       const char* message, const char* details_json) {
    event_log.appendDetails(category, level, event, message, details_json);
    Serial.printf("[%s] %s\n", event, message);
}

void startCameraServer();
void reply_invalid_payload(MongooseHttpServerRequest *req);
bool process_command(const std::shared_ptr<Command> &command, String& error_msg);
void plant_to_servo(Target::Value target);
const char* target_to_string(Target::Value target);
void read_nano_soil_moistures();
int servo_degrees_to_us(float degrees);
void begin_calibration();
void tick_calibration();
void move_servo_to_position(int position);
void tick_dispensing();
void schedule_pump_start();
void load_wifi_credentials();
void on_wifi_connected(WiFiEvent_t event);
void on_wifi_disconnected(WiFiEvent_t event);
void handle_serial_command();
void init_time_ntp();
String load_server_url();

void setup_command_routes();

void setup() {
    Serial.begin(115200);
    Serial.setDebugOutput(true);
    Serial.println();

    Serial.println("###############################");
    Serial.println("#       Smart Sprinkler       #");
    Serial.println("###############################");
    Serial.println();

    esp_task_wdt_init(10, true);
    esp_task_wdt_add(NULL);

    load_wifi_credentials();

    init_time_ntp();

    event_log.begin();
    event_publisher.setServerUrl(load_server_url());
    log_event("system", "info", "boot", String("Smart Sprinkler firmware " + String(FW_VERSION)).c_str());

    // Camera::init();

    Serial.print("Device's MAC Address: ");
    Serial.println(WiFi.macAddress());

    WiFi.onEvent(on_wifi_connected, ARDUINO_EVENT_WIFI_STA_GOT_IP);
    WiFi.onEvent(on_wifi_disconnected, ARDUINO_EVENT_WIFI_STA_DISCONNECTED);

    WiFi.mode(WIFI_MODE_STA);
    WiFi.setHostname(hostname);
    WiFi.begin(wifi_ssid.c_str(), wifi_password.c_str());

    Serial.print("Connecting to WiFi");
    const unsigned long wifi_timeout_start = millis();
    while (WiFi.status() != WL_CONNECTED && millis() - wifi_timeout_start < 20000) {
        delay(200);
        esp_task_wdt_reset();
        Serial.print(".");
    }
    if (WiFi.status() == WL_CONNECTED) {
        WiFiAddr = WiFi.localIP().toString();
        Serial.print(format("Server Ready! Use 'http://%s' to connect\n", WiFiAddr));
        log_event("network", "info", "wifi_connected", ("WiFi connected, IP " + WiFiAddr).c_str());
    } else {
        Serial.println("\n! WiFi not connected — restarting connection in background (reconnect handler active).");
        WiFiAddr = String(hostname) + ".local";
        log_event("network", "warn", "wifi_connect_failed", "WiFi not connected at boot");
    }

    water_pump.switch_off();

    rotary_servo.attach(PIN_ROTARY_SERVO, SERVO_MIN_US, SERVO_MAX_US);
    Serial.println("Rotary servo attached (GPIO 13)");

    begin_calibration();

    NanoSerial.begin(9600, SERIAL_8N1, NANO_RX_PIN, NANO_TX_PIN);
    Serial.println("Nano UART2 initialized (RX=14, TX=15)");

