AleMuzzi/SmartSprinkler/firmware/src/esp32/main.cpp
    command_manager.init();
    setup_command_routes();
    command_manager.setup_ota();

    Serial.print("Smart Sprinkler firmware ");
    Serial.println(FW_VERSION);

    log_event("system", "info", "ready", "System fully initialized");
    Serial.println("\n\nSystem Fully Initialized!");
    Serial.println("-------------------------------");
}

void loop() {
    esp_task_wdt_reset();

    const unsigned long currentMillis = millis();

    tick_calibration();

    if (currentMillis - previousMillis >= interval) {
        previousMillis = currentMillis;
        read_nano_soil_moistures();

        if (nano_connected && !nano_lost_logged && millis() - last_nano_data_ms > 6000) {
            nano_lost_logged = true;
            nano_connected = false;
            log_event("sensor", "warn", "sensor_nano_lost", "Nano sensor data lost");
        }

        Serial.printf("[%lu] T=%.1f H=%.1f SM=[%d,%d,%d,%d] WL=%s\n",
            currentMillis / 1000,
            air_temperature, air_humidity,
            soil_moisture_raw[0], soil_moisture_raw[1],
            soil_moisture_raw[2], soil_moisture_raw[3],
            water_low_alert ? "LOW" : "OK");
    }

    if (!command_manager.is_stopped()) {
        command_manager.poll();
    }

    tick_dispensing();
    event_publisher.tick();
    handle_serial_command();

    delay(10);
}

static void sendCorsJson(MongooseHttpServerRequest *req, int code, const char *content) {
    auto *resp = req->beginResponseStream();
    resp->setCode(code);
    resp->addHeader("Access-Control-Allow-Origin", "*");
    resp->setContentType("application/json");
    resp->write((const uint8_t*)content, strlen(content));
    req->send(resp);
}

void setup_command_routes() {
    routes.put("/health", Route{
                .http_method = HTTP_GET,
                .from_json = nullptr,
                .handler = [](MongooseHttpServerRequest *req, const std::shared_ptr<ICanBeDeserialized>& command) {
                    sendCorsJson(req, 200, (String(R"({"status":"ok","version":")") + FW_VERSION + "\"}").c_str());
                }
            });
    routes.put("/water_alert", Route{
                .http_method = HTTP_GET,
                .from_json = nullptr,
                .handler = [](MongooseHttpServerRequest *req, const std::shared_ptr<ICanBeDeserialized>& command) {
                    sendCorsJson(req, 200, water_low_alert ? R"({"alert":true})" : R"({"alert":false})");
                }
            });
    routes.put("/command", Route{
                .http_method = HTTP_POST,
                .from_json = Command::from_json,
                .handler = [](MongooseHttpServerRequest *req, const std::shared_ptr<ICanBeDeserialized>& command) {
                    const auto curr_command = std::static_pointer_cast<Command>(command);

                    if (curr_command->getType() != "Command") {
                        reply_invalid_payload(req);
                        return;
                    }

                    String error_msg;
                    const String details =
                        String("{\"action\":\"") + Action::to_string(curr_command->get_action()) +
                        "\",\"target\":\"" + Target::to_string(curr_command->get_target()) +
                        "\",\"amount\":" + String(curr_command->get_amount()) +
                        ",\"force\":" + (curr_command->get_force() ? "true" : "false") + "}";

                    log_event_details("command", "info", "command_received", "Command received", details.c_str());

                    if (process_command(curr_command, error_msg)) {
                        log_event_details("command", "info", "command_accepted", "Command accepted", details.c_str());
                        sendCorsJson(req, 200, R"({"status":"ok"})");
                        return;
                    }

                    log_event_details("command", "warn", "command_rejected", error_msg.c_str(), details.c_str());
                    sendCorsJson(req, 400, (String(R"({"status":"error","error_code":"invalid_command","message":")") + error_msg + "\"}").c_str());
                }
            });
    routes.put("/status", Route{
                .http_method = HTTP_GET,
                .from_json = nullptr,
                .handler = [](MongooseHttpServerRequest *req, const std::shared_ptr<ICanBeDeserialized>& command) {
                    Hashtable<String, String> status;
                    status.put("status", "ok");
                    status.put("air_temperature", String(air_temperature, 2));
                    status.put("air_humidity", String(air_humidity, 2));
                    status.put("soil_moisture", String(soil_moisture, 2));
                    status.put("water_pump", water_pump.is_on() ? "on" : "off");
                    status.put("rotary_position", rotary_calibrated ? String(rotary_current_position) : "uncalibrated");
                    status.put("soil_moisture_0", String(constrain(map(soil_moisture_raw[0], SOIL_DRY_ADC, 0, 0, 100), 0, 100)));
                    status.put("soil_moisture_1", String(constrain(map(soil_moisture_raw[1], SOIL_DRY_ADC, 0, 0, 100), 0, 100)));
                    status.put("soil_moisture_2", String(constrain(map(soil_moisture_raw[2], SOIL_DRY_ADC, 0, 0, 100), 0, 100)));
                    status.put("soil_moisture_3", String(constrain(map(soil_moisture_raw[3], SOIL_DRY_ADC, 0, 0, 100), 0, 100)));
                    status.put("water_low_alert", water_low_alert ? "on" : "off");
                    status.put("blocked_amount_ml", String(blocked_amount_ml));
                    status.put("active_plant", water_pump.is_on() ? target_to_string(active_target) : "null");
                    status.put("camera_url", (WiFiAddr + ":81/stream").c_str());

                    String statusJson = hashtable_to_string(status);
                    sendCorsJson(req, 200, statusJson.c_str());
                }
            });
    command_manager.setup_routes(routes);
}

void reply_invalid_payload(MongooseHttpServerRequest *req) {
    sendCorsJson(req, 400, R"({"status":"error","error_code":"invalid_payload","message":"Invalid payload type"})");
}

