AleMuzzi/SmartSprinkler/firmware/src/esp32/main.cpp
int servo_degrees_to_us(float degrees) {
    const float range_us = SERVO_MAX_US - SERVO_MIN_US;
    return SERVO_MIN_US + static_cast<int>((degrees / 180.0f) * range_us);
}

float servo_position_to_degrees(int position) {
    return ROTARY_START_DEG + (position * ROTARY_DELTA_DEG);
}

void move_servo_to_position(int position) {
    if (position < 0 || position >= ROTARY_POSITION_COUNT) {
        Serial.print("Invalid position: ");
        Serial.println(position);
        return;
    }
    const float angle = servo_position_to_degrees(position);
    const int us = servo_degrees_to_us(angle);
    rotary_servo.writeMicroseconds(us);
    rotary_current_position = position;
    Serial.print("Servo moved to position ");
    Serial.print(position);
    Serial.print(" (");
    Serial.print(angle);
    Serial.print(" deg, ");
    Serial.print(us);
    Serial.println(" us)");
}

void begin_calibration() {
    Serial.println("Starting rotary calibration (non-blocking)...");
    log_event("system", "info", "calibration_started", "Rotary calibration started");
    calibration_in_progress = true;
    calibration_step = 0;
    calibration_all_success = true;
    calibration_moved_at_ms = millis();
    move_servo_to_position(0);
}

void tick_calibration() {
    if (!calibration_in_progress) {
        return;
    }

    const unsigned long now = millis();
    if (now - calibration_moved_at_ms < 800) {
        return;
    }

    const int position = calibration_step;
    const float angle = servo_position_to_degrees(position);
    const int target_us = servo_degrees_to_us(angle);
    const int actual_us = rotary_servo.readMicroseconds();
    const int error = abs(actual_us - target_us);

    if (error > 100) {
        Serial.print("Calibration warning at position ");
        Serial.print(position);
        Serial.print(": expected ");
        Serial.print(target_us);
        Serial.print(" us, got ");
        Serial.print(actual_us);
        Serial.print(" us (error ");
        Serial.print(error);
        Serial.println(" us)");
        calibration_all_success = false;
    } else {
        Serial.print("Position ");
        Serial.print(position);
        Serial.print(" OK (");
        Serial.print(actual_us);
        Serial.println(" us)");
    }

    calibration_step++;
    if (calibration_step >= ROTARY_POSITION_COUNT) {
        calibration_in_progress = false;
        if (calibration_all_success) {
            rotary_calibrated = true;
            log_event("system", "info", "calibration_completed", "Rotary calibration SUCCESS");
            Serial.println("Rotary calibration: SUCCESS — all positions verified");
        } else {
            rotary_calibrated = false;
            log_event("system", "warn", "calibration_partial", "Rotary calibration PARTIAL — using software tracking");
            Serial.println("Rotary calibration: PARTIAL — using software tracking");
        }
        rotary_current_position = 0;
        rotary_servo.writeMicroseconds(servo_degrees_to_us(0));
        return;
    }

    calibration_moved_at_ms = now;
    move_servo_to_position(calibration_step);
}

void plant_to_servo(Target::Value target) {
    int position;
    switch (target) {
        case Target::HABANERO:      position = 4; break;
        case Target::NAGA_MORICH:   position = 3; break;
        case Target::CAROLINA_REAPER: position = 2; break;
        case Target::ROSMARINO:     position = 1; break;
        default: position = 0;
    }
    move_servo_to_position(position);
}

const char* target_to_string(const Target::Value target) {
    switch (target) {
        case Target::HABANERO:      return "HABANERO";
        case Target::NAGA_MORICH:   return "NAGA_MORICH";
        case Target::CAROLINA_REAPER: return "CAROLINA_REAPER";
        case Target::ROSMARINO:     return "ROSMARINO";
    }
    return "UNKNOWN";
}

#define NANO_LINE_MAX 64
static char nano_line[NANO_LINE_MAX];
static int nano_line_idx = 0;

static void parse_nano_line(const char* line) {
    if (line == nullptr || line[0] != 'S') {
        while (NanoSerial.available()) NanoSerial.read();
        nano_line_idx = 0;
        return;
    }
    int s0, s1, s2, s3, water_ok;
    float temp, hum;
    if (sscanf(line, "S:%d#%d#%d#%d#%f#%f#%d", &s0, &s1, &s2, &s3, &temp, &hum, &water_ok) == 7) {
        soil_moisture_raw[0] = s0;
        soil_moisture_raw[1] = s1;
        soil_moisture_raw[2] = s2;
        soil_moisture_raw[3] = s3;
        const bool low = (water_ok == 0);
        if (low != prev_water_low_alert) {
            prev_water_low_alert = low;
            water_low_alert = low;
            if (low) {
                log_event("alert", "warn", "water_low_on", "Water level low (float switch)");
            } else {
                log_event("alert", "info", "water_low_off", "Water level restored");
            }
        } else {
            water_low_alert = low;
        }
        const bool valid = (temp != -1 && hum != -1);
        if (!valid && prev_sensor_reading_valid && millis() - last_sensor_warn_ms > 60000) {
            last_sensor_warn_ms = millis();
            log_event("sensor", "warn", "sensor_invalid_reading", "Invalid temperature/humidity reading from Nano");
        }
        prev_sensor_reading_valid = valid;
        if (valid) {
            air_temperature = temp;
            air_humidity = hum;
        }
        last_nano_data_ms = millis();
        if (nano_lost_logged) {
            nano_lost_logged = false;
        }
    } else {
        if (millis() - last_sensor_warn_ms > 60000) {
            last_sensor_warn_ms = millis();
            log_event("sensor", "warn", "sensor_nano_parse_error", "Malformed Nano sensor line");
        }
    }
}

void read_nano_soil_moistures() {
    while (NanoSerial.available()) {
        const char c = NanoSerial.read();
        if (c == '\n') {
            nano_line[nano_line_idx] = '\0';
            if (nano_line_idx > 0) {
                parse_nano_line(nano_line);
            }
            nano_line_idx = 0;
        } else if (c != '\r' && nano_line_idx < NANO_LINE_MAX - 1) {
            nano_line[nano_line_idx++] = c;
        } else if (nano_line_idx >= NANO_LINE_MAX - 1) {
            nano_line_idx = 0;
        }
    }
    if (!nano_connected && nano_line_idx > 0) {
        nano_connected = true;
        nano_lost_logged = false;
        log_event("sensor", "info", "sensor_nano_connected", "Nano sensor data received");
        Serial.println("Nano sensor data received");
    }
    const int avg_raw = (soil_moisture_raw[0] + soil_moisture_raw[1] +
                         soil_moisture_raw[2] + soil_moisture_raw[3]) / 4;
    soil_moisture = constrain(map(avg_raw, SOIL_DRY_ADC, 0, 0, 100), 0, 100);
}

bool process_command(const std::shared_ptr<Command> &command, String& error_msg) {
    if (calibration_in_progress) {
        error_msg = "Rotary calibration in progress — try again in a few seconds.";
        Serial.println(error_msg);
        return false;
    }

    switch (command->get_action()) {
        case Action::STOP:
            Serial.println("Stopping dispensing.");
            dispensing_specific = false;
            dispensing_target_ml = 0;
            pump_start_pending = false;
            water_pump.switch_off();
            break;
        case Action::START:
            if (water_low_alert && !command->get_force()) {
                error_msg = "Water level low — watering blocked. Use force=true to override.";
                Serial.println(error_msg);
                blocked_amount_ml = 0;
                return false;
            }
            Serial.println("Starting dispensing.");
            active_target = command->get_target();
            plant_to_servo(active_target);
            schedule_pump_start();
            break;
        case Action::DISPENSE_SPECIFIC_AMOUNT:
        {
            if (water_low_alert && !command->get_force()) {
                error_msg = "Water level low — blocked " + String(command->get_amount()) + " ml.";
                Serial.println(error_msg);
                blocked_amount_ml = command->get_amount();
                return false;
            }
            active_target = command->get_target();
            dispensing_specific = true;
            dispensing_target_ml = command->get_amount();
            plant_to_servo(active_target);
            schedule_pump_start();
            Serial.print("Dispensing ");
            Serial.print(command->get_amount());
            Serial.println(" ml (non-blocking).");
            break;
        }
        default:
            error_msg = "Unknown command: " + String(command->get_action());
            Serial.println(error_msg);
            return false;
    }

