AleMuzzi/SmartSprinkler/firmware/src/esp32/main.cpp
    return true;
}

void schedule_pump_start() {
    pump_start_pending = true;
    pump_start_planned_ms = millis() + 500;
}

void tick_dispensing() {
    const unsigned long now = millis();

    if (pump_start_pending && now >= pump_start_planned_ms) {
        pump_start_pending = false;
        water_pump.switch_on();
        if (dispensing_specific) {
            dispensing_start_ms = now;
        }
        const String details = String("{\"target\":\"") + target_to_string(active_target) +
                               "\",\"amount\":" + String(dispensing_target_ml) + "}";
        log_event_details("command", "info", "watering_started", "Pump switched ON", details.c_str());
        Serial.println("Pump switched ON (after servo settle).");
    }

    if (dispensing_specific && water_pump.is_on()) {
        const unsigned long elapsed_ms = now - dispensing_start_ms;
        const unsigned long duration_ms = (static_cast<unsigned long>(dispensing_target_ml) * 60000UL) / FLOW_RATE_ML_PER_MIN;
        if (elapsed_ms >= duration_ms) {
            const String details = String("{\"target\":\"") + target_to_string(active_target) +
                                   "\",\"amount\":" + String(dispensing_target_ml) + "}";
            dispensing_specific = false;
            dispensing_target_ml = 0;
            water_pump.switch_off();
            log_event_details("command", "info", "watering_completed", "Auto-stop: target amount dispensed", details.c_str());
            Serial.println("Auto-stop: target amount dispensed.");
        }
    }
}

void load_wifi_credentials() {
    prefs.begin("wifi", false);
    wifi_ssid = prefs.getString("ssid", WIFI_SSID_LOCAL);
    wifi_password = prefs.getString("password", WIFI_PASSWORD_LOCAL);
    if (wifi_ssid.length() == 0 || wifi_password.length() == 0) {
        wifi_ssid = WIFI_SSID_LOCAL;
        wifi_password = WIFI_PASSWORD_LOCAL;
        prefs.putString("ssid", wifi_ssid);
        prefs.putString("password", wifi_password);
    }
    prefs.end();
    Serial.println("WiFi credentials loaded from NVS/local config.");
}

void init_time_ntp() {
    // Europe/Rome with DST. Without NTP the ESP falls back to the server clock
    // (see EventPublisher / EventLog::setServerEpoch).
    configTzTime("CET-1CEST-2,M3.5.0/2,M10.5.0/3", "pool.ntp.org", "time.google.com");
}

String load_server_url() {
    prefs.begin("server", false);
    String url = prefs.getString("url", SMARTSPRINKLER_SERVER_URL);
    if (url.length() == 0) {
        url = SMARTSPRINKLER_SERVER_URL;
    }
    prefs.end();
    return url;
}

void on_wifi_connected(WiFiEvent_t event) {
    WiFiAddr = WiFi.localIP().toString();
    Serial.print("WiFi connected: ");
    Serial.println(WiFiAddr);
    Serial.print(format("Server Ready! Use 'http://%s' to connect\n", WiFiAddr));
    log_event("network", "info", "wifi_connected", ("WiFi connected, IP " + WiFiAddr).c_str());
}

void on_wifi_disconnected(WiFiEvent_t event) {
    WiFiAddr = String(hostname) + ".local";
    Serial.println("WiFi disconnected — attempting to reconnect...");
    WiFi.reconnect();
    log_event("network", "warn", "wifi_disconnected", "WiFi disconnected");
}

void handle_serial_command() {
    if (Serial.available() == 0) {
        return;
    }

    static String line = "";
    while (Serial.available()) {
        const char c = Serial.read();
        if (c == '\n') {
            line.trim();
            if (line.length() > 0) {
                Serial.print("Serial command: ");
                Serial.println(line);
                if (line.startsWith("WIFI")) {
                    int first_space = line.indexOf(' ');
                    if (first_space > 0) {
                        const int second_space = line.indexOf(' ', first_space + 1);
                        if (second_space > 0) {
                            const String new_ssid = line.substring(first_space + 1, second_space);
                            const String new_password = line.substring(second_space + 1);
                            if (new_ssid.length() > 0 && new_password.length() > 0) {
                                prefs.begin("wifi", false);
                                prefs.putString("ssid", new_ssid);
                                prefs.putString("password", new_password);
                                wifi_ssid = new_ssid;
                                wifi_password = new_password;
                                prefs.end();
                                Serial.println("WiFi credentials updated. Reconnecting...");
                                WiFi.disconnect();
                                WiFi.begin(wifi_ssid.c_str(), wifi_password.c_str());
                            }
                        }
                    }
                } else if (line.startsWith("SERVER")) {
                    int first_space = line.indexOf(' ');
                    if (first_space > 0) {
                        const String new_url_line = line.substring(first_space + 1);
                        String new_url = new_url_line;
                        new_url.trim();
                        if (new_url.length() > 0) {
                            prefs.begin("server", false);
                            prefs.putString("url", new_url);
                            prefs.end();
                            event_publisher.setServerUrl(new_url);
                            log_event("network", "info", "server_url_updated", ("Server URL updated: " + new_url).c_str());
                            Serial.println("Server URL updated.");
                        }
                    }
                } else {
                    Serial.println("Unknown command. Usage: WIFI <ssid> <password> | SERVER <url>");
                }
            }
            line = "";
        } else {
            line += c;
        }
    }
}